#+TITLE: Smartory.org 
#+DATE: Fri May 16 08:13:56 2014
#+AUTHOR: Shunchao Wang
#+EMAIL: shunchao.wang@osumc.edu

* Tasks
** DONE Update DataSource.config				:DEVELOPMENT:
   CLOSED: [2014-05-17 Sat 09:21]
  [ ] dev env to use h2 db
  [ ] test env to use mysql
  [ ] prod to use tomcat jndi resource
  :LOGBOOK:
  CLOCK: [2014-05-16 Fri 08:14]--[2014-05-16 Fri 08:15] =>  0:01
  :END:
  [2014-05-16 Fri 08:14]
** DONE Update listArchive.gsp to not show 'Operation' with archived items :DEVELOPMENT:
   CLOSED: [2014-05-17 Sat 09:32]
  [2014-05-16 Fri 08:20]
** DONE Set archived when user register				:DEVELOPMENT:
   CLOSED: [2014-05-17 Sat 09:24]
   :LOGBOOK:
   CLOCK: [2014-05-16 Fri 13:25]--[2014-05-16 Fri 13:26] =>  0:01
   :END:
   [2014-05-16 Fri 13:25]
** DONE Create/edit inventory should not show 0 quantity
   CLOSED: [2014-05-21 Wed 19:52]
   :LOGBOOK:
   CLOCK: [2014-05-21 Wed 19:07]--[2014-05-21 Wed 19:52] =>  0:45
   CLOCK: [2014-05-21 Wed 14:54]--[2014-05-21 Wed 14:55] =>  0:01
   :END:
   [2014-05-21 Wed 14:54]
** DONE Home page should display the real warehouse name for the alerts
   CLOSED: [2014-05-21 Wed 19:54]
   [2014-05-21 Wed 14:55]
** DONE Missing memo for sale creation
   CLOSED: [2014-05-22 Thu 08:21]
   :LOGBOOK:
   CLOCK: [2014-05-21 Wed 14:55]--[2014-05-21 Wed 14:56] =>  0:01
   :END:
   [2014-05-21 Wed 14:55]
* Notes

